In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
labels = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a":10, "b":20, "c":30}

# Series

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

**You can specify what to be an index**  
- using index
- 순서만 맞다면 data와 index를 명시하지 않아도 됨
- 파이썬 리스트와 NumPy array는 똑같이 작동한다.
- 딕셔너리 넣으면 자동으로 키값을 인덱스로 사용한다.

In [7]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

**두번째 인자는 인덱스**

In [8]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

**다양한 데이터 타입을 담을 수 있고 심지어 built-in함수도 가능**

In [14]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [15]:
ser1 = pd.Series([1,2,3,4], ["USA", "Germany","USSR","Japan"])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4], ["USA","Germany","Italy","Japan"])

In [18]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [19]:
ser1["USA"]

1

In [20]:
ser3 = pd.Series(data=labels)

In [21]:
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser3[0]

'a'

**NumPy나 Pandas의 경우 연산 돌리면 결과가 float가 된다.**  
*인덱스가 다르면 NaN 뜬다.*

In [24]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrame  
> series의 묶음, selecting column, selecting columns, add/drop new columns, selecting rows, selecting subsets

**pd.DataFrame(데이터, 행, 열)**

In [14]:
from numpy.random import randn

In [26]:
np.random.seed(101)

In [28]:
df = pd.DataFrame(randn(5,4), ["A","B","C","D","E"], ["W","X","Y","Z"])

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**column은 그냥 series이다.** 
> DataFrame은 index를 공유하는 Series의 묶음이다.

In [32]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
type(df["W"])

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

*이렇게 바로 그냥 .열이름 이래도 되지만, 내장 메소드 이름과 헷갈릴 수 있기에 아래처럼 하지 말자.*

In [36]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

**Selecting Multiple columns**

In [41]:
df[["W","X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

**새로운 칼럼 만들기**

In [42]:
df["new"] = df["W"] + df["Y"]

In [43]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**기존 칼럼을 버릴땐 drop 쓰면 되는데 두번째 인자 args로 axis=1을 지정해야 한다.**  
> 디폴트는 axis=0인데 이건 행을 날리겠다는 것.

In [44]:
df.drop("new", axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**왜 안 지워졌냐? 바로 적용시키려면 inplace 인자를 True로 넣어줘야 한다.**

In [46]:
df.drop("new",axis=1, inplace=True)

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**행도 지울 수 있다.**

In [48]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**아니 근데 왜 행은 0이고 열은 1이냐?**
> 알고보니 pandas DataFrame은 NumPy array의 fancy한 index marker

In [50]:
df.shape

(5, 4)

**Selecting Rows**
> 알고보니 rows도 series였던 것..!

*loc 쓰면 행의 이름을 알려주면 된다.*

In [51]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

*iloc 쓰면 몇 번째 행인지 알려주면 된다.*

In [52]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

**Selecting Subsets**

In [53]:
df.loc["B","Y"]

-0.8480769834036315

In [54]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DataFrame Part.2
- Conditional Selection, 
- Multiple conditions, 
- reset index, 
- add new columns, 
- set index

**Conditional Selection**
> True면 값을, False면 NaN

In [55]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [58]:
booldf = df > 0

In [59]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [60]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

*Returning series*

In [62]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

**W열에서 0보다 큰 행만 가져온다**

In [63]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [66]:
resultdf = df[df["W"]>0]

In [67]:
resultdf["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [68]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df[df["W"]>0][["Y","Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

**Multiple conditions**  
> and 쓰면 안된다. & 이거 써라.  
or 안된다. | 이거 써라.

In [71]:
df[(df["W"]>0) & (df["Y"]>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**reset index**
> 마찬가지로 inplace=True 넣어야 본래 df가 업데이트 된다.

In [73]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

**새로운 column 추가하기**

In [74]:
newind = "CA NY WY OP CO".split()

In [75]:
newind

['CA', 'NY', 'WY', 'OP', 'CO']

In [76]:
df["States"] = newind

In [77]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OP
E  0.190794  1.978757  2.605967  0.683509     CO

**reset은 원래 index를 보관하지만, set_index하면 원래 index는 날라간다.**  
*마찬가지로 inplace 안 넣으면 본래 df는 안 변한다.*

In [78]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OP      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Pandas - DataFrames Part3

In [15]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [7]:
outside = ["G1", "G1", "G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]

In [10]:
hier_index = list(zip(outside, inside))

**zip()은 tuple pair를 만든다.**

In [6]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

**pandas function to create a multi index from it**

In [11]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [16]:
df = pd.DataFrame(randn(6,2), hier_index, ["A","B"])

In [17]:
df

             A         B
G1 1 -1.199149  0.150809
   2  0.504553  1.078306
   3 -0.036932 -0.900296
G2 1  0.767757  0.839802
   2  0.108687  0.776463
   3  1.065929 -0.822677

**get sub data set**

In [18]:
df.loc["G1"]

          A         B
1 -1.199149  0.150809
2  0.504553  1.078306
3 -0.036932 -0.900296

In [19]:
df.loc["G1"].loc[1]

A   -1.199149
B    0.150809
Name: 1, dtype: float64

**인덱스의 이름을 정해주자**

In [21]:
df.index.names

FrozenList([None, None])

In [22]:
df.index.names = ["Groups", "Num"]

In [23]:
df

                   A         B
Groups Num
G1     1   -1.199149  0.150809
       2    0.504553  1.078306
       3   -0.036932 -0.900296
G2     1    0.767757  0.839802
       2    0.108687  0.776463
       3    1.065929 -0.822677

In [24]:
df.loc["G2"].loc[2]["B"]

0.7764630387109293

**Cross Section xs**
> 얘가 좋은 점은 multi index에서 하위에 있는, 예를 들면 Num 인덱스에 있는 애들을 뽑을 수 있다.  
Groups 인덱스에 사용하면 .[loc]와 똑같음.

In [25]:
df.xs("G1")

            A         B
Num
1   -1.199149  0.150809
2    0.504553  1.078306
3   -0.036932 -0.900296

In [26]:
df.xs(1, level="Num")

               A         B
Groups
G1     -1.199149  0.150809
G2      0.767757  0.839802

# Missing Data

In [27]:
d = {"A":[1,2,np.nan],"B":[5,np.nan, np.nan],"C":[1,2,3]}

In [28]:
df = pd.DataFrame(d)

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

*그냥 쓰면 행을 갖다버린다.*

In [30]:
df.dropna()

     A    B  C
0  1.0  5.0  1

*column에 대해 실행하고 싶다? axis=1*

In [31]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

**버리는 기준을 정할 수도 있다.**

In [32]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

**빈칸 채우기 쌉가능**

In [33]:
df.fillna(value="fill value")

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

*평균값으로 채워넣기*

In [35]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby
> Groupby를 통해 group rows together and perform an aggregate function  
> aggregate의 의미: 여러 값을 받아 하나의 값을 리턴한다.

In [38]:
data = {"Company":["GOOG","GOOG","MSFT","MSFT","FB","FB"], "Person":["Sam","Charlie","Amy","Vanessa","Carl","Sarah"], "Sales":[200,120,340,124,243,350]}

In [39]:
df = pd.DataFrame(data)

In [40]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**그냥 groupby만 하면 객체정보를 보여준다.**

In [41]:
byComp = df.groupby("Company")

In [44]:
byComp

**aggregate 함수를 쓰자**
> string에 대해서는 평균, sum 이런 연산이 안된다.

In [42]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [43]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [45]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [46]:
df.groupby("Company").sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [47]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

*string은 min이 빠른 철자, max가 알파벳 순서에서 뒤에 있는 철자*

In [48]:
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [49]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

**describe method**

In [50]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [51]:
df.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

**Concatenation**  
pd.concat([df1, df2, df3])  
dimensions should match along the axis.  
default는 row.  
만약 column을 기준으로 concat하려면 axis=1  
pd.concat([df1, df2, df3], axis=1)  

**Merging**   
merge DF together using a similar logic as merging SQL tables  
pd.merge(left_df,right_df, how="inner", on="key")  
default는 inner  
key라는 이름의 column을 기준으로 merge해라  
pd.merge(left_df,right_df, how="inner", on=["key1","key2"])
how에는 "outer", "right", "left"같은 조건도 있음.  

**Joining**  
combining the columns of two potentially differently-indexed DataFrames into a sing result DF.  
df1.join(df2)  
디폴트는 inner  
how="outer" 이런식으로 "outer","left","right" 지정할 수도 있다.

# Operations

In [21]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2":[444,555,666,444], "col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df["col2"]

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

**finding unique value**

In [5]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

**finding number of unique value**

In [8]:
len(df["col2"].unique())

3

In [9]:
df["col2"].nunique()

3

In [10]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

**Conditional Selection**

In [11]:
df[df["col1"]>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [12]:
df["col1"]>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

*multiple conditions using &*

In [14]:
df[(df["col1"]>2) & (df["col2"]>555)]

   col1  col2 col3
2     3   666  ghi

In [15]:
def times2(x):
    return x*2

*.sum()과 같이 custome 함수를 df에 적용하려면?*

In [16]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

*built-in 함수도 df에 적용할 수 있다.*

In [18]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

*lambda도 가능*

In [19]:
df["col2"].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

*column을 날릴 때는 axis=1*  
*바로 적용하려면 inplace=True*

In [22]:
df.drop("col1", axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

*indexing columns*

In [24]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting!**

In [26]:
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [27]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

*check for null*

In [28]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [29]:
data = {
    "A": ["foo","foo","foo","bar","bar","bar"],
    "B":["one","one","two","two","one","one"],
    "C":["x","y","x","y","x","y"],
    "D":[1,3,2,5,4,1]
}
df = pd.DataFrame(data)

In [30]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

**Pivot table**

In [31]:
df.pivot_table(values="D", index=["A","B"], columns=["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input / Output  
- CSV
- Excel
- HTML
- SQL: sqlalchemy 이용

In [33]:
pwd

'C:\\Users\\USER\\dev\\udemy_ML'

In [54]:
df = pd.read_csv(r'./Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/example')

In [55]:
# 이거할 때 index=False 해놓으면 index는 csv로 안 감.
# 만약 index명시 안 하면 csv파일에 unnamed라는 이름으로 index도 가져옴.
df.to_csv("My_output", index=False)

*엑셀에서 데이터만 가져올 수 있다. formulas, images, macros는 못 가져옴.*

In [60]:
df = pd.read_excel(r'./Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/Excel_Sample.xlsx', sheet_name="Sheet1")

In [61]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [65]:
df.to_excel("Excel_Sample2.xlsx", sheet_name="NewSheet", index=False)

In [66]:
data = pd.read_html("https://www.fdic.gov/Bank/individual/failed/banklist.html")

In [67]:
type(data)

list

In [69]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"